gap> c := (2^400) mod 467;
#! 137
gap> d := (2^134) mod 467;
#! 84
gap> (c^134) mod 467;
#! 90
gap> (d^400) mod 467;
#! 90
